src/cf/InformationRegisters/ЖурналПередачиДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ЖурналПередачиДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Возвращен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.КонтактныеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипЭкземпляра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭкземпляров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерЭкземпляра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияСостоянийДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСостоянийДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/ТекущиеСостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеСостоянияДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаУстановки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Установил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДокументыПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Действия</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СостоянияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияДокументов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаДоработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаИсполнении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОзнакомлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодготовке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаПодписании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаУтверждении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеЗарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеУтвержден</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОзнакомлениеЗавершено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подписан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проект</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рассмотрен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Утвержден</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ДелаХраненияДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ДелаХраненияДокументов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДелоЗакрыто</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЛистов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоХраненияДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаХраненияДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатураДел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТома</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЧасти</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтноситсяКНоменклатуреДел</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НоменклатураДел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.НоменклатураДел</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/НоменклатураДел.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НоменклатураДел</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидыДокументовЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВопросыДеятельностиЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГрифыДоступа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияДела</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентыЗаполнены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомераСтатей</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтметкаЭПК</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоЛичномуСоставу</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыНоменклатурыДел</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокОперативногоХранения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокХранения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦППК_РазрядПорядка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормаДокументов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыФормДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыДеятельности</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВопросДеятельности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВопросыДеятельности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/РаботаСИнструкциямиПереопределяемый/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// МОДУЛЬ ПО РАБОТЕ С ИНСТРУКЦИЯМИ
//
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Возвращает соответствия форм с предметами инструкций
//
Функция СоответствияФормИПредметовИнструкций() Экспорт
	
	Соответствие = Новый Соответствие;
	
	Соответствие.Вставить("Справочник.СертификатыЭП.Форма.ВыборСертификатаДляПодписания", Справочники.ПредметыИнструкций.ЭлектроннаяПодпись);
	
	Соответствие.Вставить("Справочник.ДокументыПредприятия.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.ДокументыПредприятия);
	
	Соответствие.Вставить("Справочник.ДелаХраненияДокументов.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.Дела);
	
	Соответствие.Вставить("Справочник.НоменклатураДел.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.НоменклатураДел);
	
	Соответствие.Вставить("Документ.ДействиеЗадачи.Форма.ФормаЭлемента", Справочники.ПредметыИнструкций.Задачи);
	
	Соответствие.Вставить("Документ.ЕжедневныйОтчет.Форма.ФормаДокумента", Справочники.ПредметыИнструкций.ЕжедневныйОтчет);
	
	Соответствие.Вставить("РегистрСведений.ЖурналПередачиДокументов.Форма.ФормаЗаписи", Справочники.ПредметыИнструкций.ЖурналПередачи);
	
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессИсполнениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаЗадачиКонтролера", Справочники.ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаКонтролера);
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаЗадачиОтвИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаОтветственногоИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Исполнение.Форма.ФормаЗадачиПроверяющего", Справочники.ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаПроверяющего);
	
	Соответствие.Вставить("БизнесПроцесс.КомплексныйПроцесс.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.КомплексныйПроцессКарточка);
	Соответствие.Вставить("БизнесПроцесс.КомплексныйПроцесс.Форма.ФормаЗадачиКонтролера", Справочники.ПредметыИнструкций.ЗадачиКомплексногоПроцессаЗадачаКонтролера);
	
	Соответствие.Вставить("БизнесПроцесс.Ознакомление.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессОзнакомлениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Ознакомление.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаОзнакомлениеЗадачаИсполнителя);
	
	Соответствие.Вставить("БизнесПроцесс.Поручение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Поручение.Форма.ФормаЗадачиПроверяющего", Справочники.ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаПроверяющего);
	
	Соответствие.Вставить("БизнесПроцесс.Приглашение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессПриглашениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Приглашение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Приглашение.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаОзнакомления);
	Соответствие.Вставить("БизнесПроцесс.Приглашение.Форма.ФормаЗадачиОповестить", Справочники.ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаОповещения);
	
	Соответствие.Вставить("БизнесПроцесс.Рассмотрение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессРассмотрениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Рассмотрение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаРассмотрениеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Рассмотрение.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаРассмотрениеЗадачаОзнакомления);
	
	Соответствие.Вставить("БизнесПроцесс.Регистрация.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессРегистрацияКарточка);
	Соответствие.Вставить("БизнесПроцесс.Регистрация.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаРегистрацияЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Регистрация.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаРегистрацияЗадачаОзнакомления);
	
	Соответствие.Вставить("БизнесПроцесс.Согласование.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессСогласованиеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Согласование.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаСогласованиеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Согласование.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаСогласованиеЗадачаОзнакомления);
	
	Соответствие.Вставить("БизнесПроцесс.Утверждение.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессУтверждениеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Утверждение.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаУтверждениеЗадачаИсполнителя);
	Соответствие.Вставить("БизнесПроцесс.Утверждение.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаУтверждениеЗадачаОзнакомления);

	Соответствие.Вставить("БизнесПроцесс.Подписание.Форма.ФормаБизнесПроцесса", Справочники.ПредметыИнструкций.ПроцессПодписаниеКарточка);
	Соответствие.Вставить("БизнесПроцесс.Подписание.Форма.ФормаЗадачиИсполнителя", Справочники.ПредметыИнструкций.ЗадачиПроцессаПодписаниеЗадачаПодписанта);
	Соответствие.Вставить("БизнесПроцесс.Подписание.Форма.ФормаЗадачиОзнакомиться", Справочники.ПредметыИнструкций.ЗадачиПроцессаПодписаниеЗадачаОбрабатывающегоРезультат);
	Соответствие.Вставить("БизнесПроцесс.Подписание.Форма.ФормаЗадачиОбеспечить", Справочники.ПредметыИнструкций.ЗадачиПроцессаПодписаниеЗадачаОбеспечивающегоПодписание);
	
	Возврат Соответствие;
	
КонецФункции

// Формирует массив предметов инструкций с описаниями для указанной формы.
//
Процедура ПредметыИнструкцийСоответствующиеФорме(Предметы, ЭтаФорма, Знач ИмяФормы = "", Знач ПредметыЗадачи = Неопределено) Экспорт
	
	Предметы = Новый Массив;
	
	Если Не ЗначениеЗаполнено(ИмяФормы) Тогда
		ИмяФормы = ЭтаФорма.ИмяФормы;
	КонецЕсли;
	
	СоответствияФормИПредметов = СоответствияФормИПредметовИнструкций();
	
	Предмет = СоответствияФормИПредметов.Получить(ИмяФормы);
	
	Если Предмет = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПредметыИнструкций = Справочники.ПредметыИнструкций;
	
	Если Предмет = ПредметыИнструкций.ДокументыПредприятия Тогда
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(Предмет);
		ЗаполнитьХарактеристикиПредметаПоРеквизитамДокумента(ОписаниеПредмета, ЭтаФорма.Объект);
		Предметы.Добавить(ОписаниеПредмета);
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(ПредметыИнструкций.Документы);
		Предметы.Добавить(ОписаниеПредмета);
		
	ИначеЕсли Предмет = ПредметыИнструкций.ПроцессИсполнениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.КомплексныйПроцессКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессОзнакомлениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессПриглашениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессРассмотрениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессРегистрацияКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессСогласованиеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессУтверждениеКарточка
		ИЛИ Предмет = ПредметыИнструкций.ПроцессПодписаниеКарточка Тогда
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(Предмет);
		ЗаполнитьХарактеристикиПредметаПоРеквизитамПроцесса(ОписаниеПредмета, ЭтаФорма.Объект, ЭтаФорма);
		Предметы.Добавить(ОписаниеПредмета);
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(ПредметыИнструкций.Процессы);
		Предметы.Добавить(ОписаниеПредмета);
		
	ИначеЕсли Предмет = ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаКонтролера
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаОтветственногоИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаИсполненияЗадачаПроверяющего
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиКомплексногоПроцессаЗадачаКонтролера
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаОзнакомлениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаКонтролера
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПоручениеЗадачаПроверяющего
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаОзнакомления
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаПриглашениеЗадачаОповещения
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаРассмотрениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаРассмотрениеЗадачаОзнакомления
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаРегистрацияЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаРегистрацияЗадачаОзнакомления
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаСогласованиеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаСогласованиеЗадачаОзнакомления
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаУтверждениеЗадачаИсполнителя
		ИЛИ Предмет = ПредметыИнструкций.ЗадачиПроцессаУтверждениеЗадачаОзнакомления Тогда
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(Предмет);
		Предметы.Добавить(ОписаниеПредмета);
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(ПредметыИнструкций.Задачи);
		Предметы.Добавить(ОписаниеПредмета);
		
		Если ПредметыЗадачи = Неопределено Тогда
			ПредметыЗадачи = ЭтаФорма.Объект.Предметы;
		КонецЕсли;
		
		ЗаполнитьПредметыИнструкцийПоПредметамЗадачи(Предметы, ПредметыЗадачи);
		
	Иначе
		
		ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(Предмет);
		Предметы.Добавить(ОписаниеПредмета);
		
	КонецЕсли;
	
КонецПроцедуры

// Дополняет структуру описания предмета по реквизитам документа
//
// Параметры:
//  ОписаниеПредмета - Структура
//  Документ         - Ссылка на внутренний / входящий / исходящий документ.
//
Процедура ЗаполнитьХарактеристикиПредметаПоРеквизитамДокумента(ОписаниеПредмета, Документ) Экспорт
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьУчетПоОрганизациям") Тогда
		ОписаниеПредмета.Вставить("Организация", Документ.Организация);
	КонецЕсли;
	
	ОписаниеПредмета.Вставить("ВидДокумента", Документ.ВидДокумента);
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьГрифыДоступа") Тогда
		ОписаниеПредмета.Вставить("ГрифДоступа", Документ.ГрифДоступа);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьВопросыДеятельности") Тогда
		ОписаниеПредмета.Вставить("ВопросДеятельности", Документ.ВопросДеятельности);
	КонецЕсли;
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСостоянияДокументов") Тогда
		Если Документ.Ссылка.Пустая() Тогда
			ОписаниеПредмета.Вставить("СостояниеДокумента", Перечисления.СостоянияДокументов.Проект);
		Иначе
			ОписаниеПредмета.Вставить("СостояниеДокумента", ПолучитьПоследнееСостояниеДокумента(Документ.Ссылка));
		КонецЕсли;
	КонецЕсли;
	
	ОписаниеПредмета.Вставить("ШаблонДокумента", Документ.Шаблон);
	
КонецПроцедуры

// Дополняет структуру описания предмета по реквизитам документа
//
// Параметры:
//  ОписаниеПредмета - Структура
//  Документ         - Ссылка на внутренний / входящий / исходящий документ.
//  ЭтаФорма         -
//
Процедура ЗаполнитьХарактеристикиПредметаПоРеквизитамПроцесса(ОписаниеПредмета, Процесс, ЭтаФорма = Неопределено) Экспорт
	
	ОписаниеПредмета.Вставить("ШаблонПроцесса", Процесс.Шаблон);
	
КонецПроцедуры

// Возвращает последнее состояние документа. Если у документа больше одного состояния и
// последним состоянием является Проект, тогда возвращается состояние, установленное до него.
//
// Параметры:
//  Документ - СправочникСсылка.ДокументыПредприятия - 
//
// Возвращаемое значение:
//  ПеречислениеСсылка.СостоянияДокументов
//
Функция ПолучитьПоследнееСостояниеДокумента(Документ)
	
	// Если для документа определено одно состояние, тогда возвращаем его.
	МассивСостояний = Делопроизводство.ПолучитьВсеСостоянияДокумента(Документ).ВыгрузитьКолонку("Состояние");
	Если МассивСостояний.Количество() = 0 Тогда
		Возврат Перечисления.СостоянияДокументов.ПустаяСсылка();
	ИначеЕсли МассивСостояний.Количество() = 1 Тогда 
		Возврат МассивСостояний[0]; 
	КонецЕсли;
	
	// Определяем последнее установленное состояние.
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СостоянияДокументов.Состояние КАК Состояние
		|ИЗ
		|	РегистрСведений.ИсторияСостоянийДокументов КАК СостоянияДокументов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеСостоянияДокументов КАК ТекущиеСостоянияДокументов
		|		ПО СостоянияДокументов.Состояние = ТекущиеСостоянияДокументов.Состояние
		|			И СостоянияДокументов.Документ = ТекущиеСостоянияДокументов.Документ
		|ГДЕ
		|	СостоянияДокументов.Документ = &Документ
		|	И СостоянияДокументов.Состояние <> ЗНАЧЕНИЕ(Перечисление.СостоянияДокументов.Проект)
		|
		|УПОРЯДОЧИТЬ ПО
		|	СостоянияДокументов.Период УБЫВ";
	Запрос.УстановитьПараметр("Документ", Документ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.Состояние; 
	
КонецФункции

// Дополняет массив предметов инструкций предметами процесса
//
// Параметры:
//  Предметы         - Массив - Массив описаний предметов инструкций
//  ПредметыПроцесса - Табличная часть объекта задачи
//
Процедура ЗаполнитьПредметыИнструкцийПоПредметамЗадачи(Предметы, ПредметыЗадачи) Экспорт
	
	ПредметыДляОбработки = Новый Массив;
	
	Для Каждого ТекСтрока ИЗ ПредметыЗадачи Цикл
		
		Если Не ЗначениеЗаполнено(ТекСтрока.Предмет) Тогда
			Продолжить;
		КонецЕсли;
		
		ПредметыДляОбработки.Добавить(ТекСтрока.Предмет);
	КонецЦикла;
	
	Если Не ПользователиСерверПовтИсп.ЭтоПолноправныйПользовательИБ() Тогда
		ПользователиДляПроверкиПрав = Новый Массив;
		ПользователиДляПроверкиПрав.Добавить(ПользователиКлиентСервер.ТекущийПользователь());
		ПраваНаПредметы = ДокументооборотПраваДоступа.ПраваПользователейПоОбъектам(
			ПредметыДляОбработки, Истина, ПользователиДляПроверкиПрав);
		ПредметыДляОбработки = ПраваНаПредметы.ВыгрузитьКолонку("ОбъектДоступа");
	КонецЕсли;
	
	Для Каждого ТекСтрока ИЗ ПредметыДляОбработки Цикл
		Если ТипЗнч(ТекСтрока) = Тип("СправочникСсылка.ДокументыПредприятия") Тогда
			
			ОписаниеПредмета = РаботаСИнструкциями.ОписаниеПредметаИнструкции(
				Справочники.ПредметыИнструкций.ДокументыПредприятия);
			ЗаполнитьХарактеристикиПредметаПоРеквизитамДокумента(ОписаниеПредмета, ТекСтрока);
			Предметы.Добавить(ОписаниеПредмета);
				
		КонецЕсли;
    КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
